renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_sdhi_rx/src/r_sdhi_int.c
    p_hndl->int_callback = callback;

    return SDHI_SUCCESS;
} /* End of function R_SDHI_IntCallback() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_IntSDBuffCallback
 *****************************************************************************************************************/ /**
 * @brief This function registers the callback function for the SD buffer access interrupt (SBFAI).
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] (\*callback)(void\*)
 *             Callback function to be registered.\n 
 *             If set to a null pointer, no callback function is registered.\n 
 *             The value of (void *) is always 0.
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Registers the callback function for the SD buffer access interrupt (SBFAI). 
 *            The callback function registered by this function is called as a subroutine of the DTC's data transfer
 *            end interrupt handler when an interrupt is generated at DTC transfer end.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            The callback function registered by this function is different from the callback function of the card
 *            access interrupt (CACI) and card detect interrupt (CDETI), and from the callback function of the SDIO
 *            access interrupt (SDACI). Therefore, this callback function is not called when the above-mentioned
 *            interrupts occur.
 */
sdhi_status_t R_SDHI_IntSDBuffCallback(uint32_t channel, sdhi_status_t (* callback)(void *))
{
    sdhi_sdhndl_t * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* Not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl->int_sdbuff_callback = callback;

    return SDHI_SUCCESS;
} /* End of function R_SDHI_IntSDBuffCallback() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_IntSdioCallback
 *****************************************************************************************************************/ /**
 * @brief This function registers the callback function for the SDIO access interrupt (SDACI).
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @param[in] (*callback)(uint32_t)
 *             Callback function to be registered.\n 
 *             If set to a null pointer, no callback function is registered.\n 
 *             The first argument (uint32_t) contains the value of the SDIO status register (SDIOSTS).
 * @retval    SDHI_SUCCESS Successful operation
 * @retval    SDHI_ERR     General error
 * @details   Registers the callback function for the SDIO access interrupt (SDACI).\n 
 *            The callback function registered by this function is called as a subroutine of the interrupt handler
 *            when an SDHI SDIO interrupt is generated.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.\n 
 *            The callback function registered by this function is different from the callback function of
 *            the card access interrupt (CACI) and card detect interrupt (CDETI), and from the callback function of
 *            the SD buffer access interrupt (SBFAI). Therefore, this callback function is not called when 
 *            the above-mentioned interrupts occur.
 */
sdhi_status_t R_SDHI_IntSdioCallback(uint32_t channel, sdhi_status_t (* callback)(uint32_t))
{
    sdhi_sdhndl_t       * p_hndl = 0;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_INT, __LINE__);
        return SDHI_ERR;  /* not initialized */
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    p_hndl->int_io_callback = callback;

    return SDHI_SUCCESS;

} /* End of function R_SDHI_IntSdioCallback() */

/* End of File */
